vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA366_DFP.pdsc
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXA366.internal_condition"/>
    </condition>
    <condition id="device_id.MCXA366.internal_condition">
      <accept Dname="MCXA366VLH" Dvendor="NXP:11"/>
      <accept Dname="MCXA366VLL" Dvendor="NXP:11"/>
      <accept Dname="MCXA366VLQ" Dvendor="NXP:11"/>
      <accept Dname="MCXA366VPN" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.sgi_pkc.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXA366, component.sgi_pkc.platform.mcxa, component.sgi_pkc.pkc, component.sgi_pkc.sgi, component.sgi_pkc.trng.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXA366, component.sgi_pkc.platform.mcxa, component.sgi_pkc.pkc, component.sgi_pkc.sgi, component.sgi_pkc.trng.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXA366, component.sgi_pkc.platform.mcxa.internal_condition"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pkc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_sgi"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_trng"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXA366, component.sgi_pkc.platform.mcxa.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXA366, component.sgi_pkc.platform.mcxa.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXA366, component.sgi_pkc.platform.mcxa.internal_condition">
      <require condition="anyOf.device_id=MCXA366.internal_condition"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_platform_mcxa"/>
    </condition>
    <condition id="anyOf.device_id=MCXA366.internal_condition">
      <accept condition="device_id.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.aead.condition_id">
      <require condition="allOf.component.sgi_pkc.aes, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aes, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aes"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.aead_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.aead, component.sgi_pkc.mac_modes, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aead, component.sgi_pkc.mac_modes, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac_modes"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.aes.condition_id">
      <require condition="allOf.component.sgi_pkc.crc, component.sgi_pkc.key, component.sgi_pkc.prng, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.crc, component.sgi_pkc.key, component.sgi_pkc.prng, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_prng"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.buffer.condition_id">
      <require condition="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_core"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_data_integrity"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.cipher.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.cipher_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.cipher, component.sgi_pkc.dma, component.sgi_pkc.padding, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.cipher, component.sgi_pkc.dma, component.sgi_pkc.padding, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_dma"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_padding"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.core.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.crc.condition_id">
      <require condition="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, driver.crc, device=MCXA366.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, driver.crc, device=MCXA366.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_core"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_data_integrity"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
      <require condition="device.MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.data_integrity.condition_id">
      <require condition="allOf.device=MCXA366.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.dma.condition_id">
      <require condition="allOf.device=MCXA366.internal_condition"/>
    </condition>
