vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA366_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher_modes" Cversion="1.0.0" condition="component.sgi_pkc.cipher_modes.condition_id">
      <description>Component sgi_pkc.cipher</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Aes_Iv.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Aes_Multipart.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Aes_NonBlocking_Multipart.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Aes_NonBlocking_Oneshot.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Aes_Oneshot.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Aes_Security.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Cbc.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Cbc_Dma_NonBlocking.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Cleanup.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Ctr.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Ctr_Dma_NonBlocking.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Ecb.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Ecb_Dma_NonBlocking.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Helper.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Sgi_Modes.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCipherModes/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/mcuxClCipherModes.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/mcuxClCipherModes_Modes.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Common.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Common_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Common_Wa.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Aes_Iv.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Aes_Multipart.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Aes_NonBlocking_Multipart.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Aes_NonBlocking_Oneshot.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Aes_Oneshot.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Aes_Security.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Algorithms.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Cleanup.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Helper.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Sgi_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClCipherModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_core" Cversion="1.0.0" condition="component.sgi_pkc.core.condition_id">
      <description>Component sgi_pkc.core</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Examples.h" projectpath="component/sgi_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCore/inc/mcuxClCore_FunctionIdentifiers.h" projectpath="component/sgi_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Macros.h" projectpath="component/sgi_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Platform.h" projectpath="component/sgi_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Toolchain.h" projectpath="component/sgi_pkc/src/comps/mcuxClCore/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClCore/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_crc" Cversion="1.0.0" condition="component.sgi_pkc.crc.condition_id">
      <description>Component crc</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCrc/src/mcuxClCrc.c" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCrc/src/mcuxClCrc_Context_Crc.c" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClCrc/src/mcuxClCrc_Drv.c" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/mcuxClCrc.h" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Drv.h" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Internal_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Sfr.h" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClCrc/inc/internal/"/>
      </files>
    </component>
